[
  {
    "_id": "admissions-pal-001",
    "index": 0,
    "name": "Admissions Pal",
    "tecnology": "React.js, Node.js, Express.js, MySQL, Stripe, JWT, PWA, Real-time Analytics",
    "liveLink": "https://admissionspal.com",
    "clientLink": "https://github.com/yeasaleh2002/admissions-pal",
    "about": "Interactive networking platform for students, alumni, and recruiters with role-based architecture, secure payment system, and real-time analytics.",
    "description": [
      "Built interactive networking features that facilitate collaboration between students, alumni, and recruiters, fostering a dynamic and engaging educational community.",
      "Designed and executed a scalable, role-based architecture to efficiently manage four distinct user flows (Admin, Student, Advisor, Recruiter), enhancing security and system performance.",
      "Improved a secure, PCI-compliant payment system by integrating Stripe, enabling seamless subscription management and transaction processing.",
      "Transformed the platform into a fully responsive Progressive Web App (PWA), improving offline accessibility, reducing load times, and optimizing mobile performance.",
      "Applied real-time analytics and data-driven insights for advisors and recruiters, enhancing strategic decision-making and user engagement."
    ]
  },
  {
    "_id": "microdot-ai-002",
    "index": 1,
    "name": "Microdot.ai",
    "tecnology": "React.js, Node.js, Express.js, MongoDB, AI Transcription, Google Meet, Zoom, Microsoft Teams",
    "liveLink": "https://microdot.ai",
    "clientLink": "https://github.com/yeasaleh2002/microdot-ai",
    "about": "AI-powered meeting management platform with video integration, admin dashboard, user dashboard, and transcription system.",
    "description": [
      "Expanded a feature-rich front end for a meeting management platform, ensuring seamless integration with Google Meet, Zoom, and Microsoft Teams.",
      "Implemented an intuitive admin dashboard to manage users, videos, prompts, and payments, enhancing operational efficiency.",
      "Built a responsive user dashboard to display upcoming and past meetings, with features like invite management, meeting cancellations, and recording uploads.",
      "Integrated an AI-powered transcription system that processes audio/video uploads, generates transcripts, and enables clip creation for easy content sharing.",
      "Optimized frontend performance using React best practices, state management, and API integrations to ensure a seamless user experience."
    ]
  },
  {
    "_id": "medlink-jobs-003",
    "index": 2,
    "name": "MedLink Jobs",
    "tecnology": "React.js, Node.js, Express.js, MongoDB, Healthcare Recruitment, Job Portal, User Management",
    "liveLink": "https://medlinkjobs.com",
    "clientLink": "https://github.com/yeasaleh2002/medlink-jobs",
    "about": "India's first healthcare recruitment portal connecting professionals with top job opportunities, supporting 300,000+ registered users.",
    "description": [
      "Developed and enhanced MedLink Jobs, India's first healthcare recruitment portal, connecting professionals with top job opportunities.",
      "Designed a scalable and efficient hiring platform, ensuring rapid, transparent, and cost-effective talent acquisition in the medical industry.",
      "Enforced a user-centric experience with a secure and seamless job search interface, prioritizing data security and accessibility.",
      "Engineered robust backend optimizations to support a thriving community of 300,000+ registered users, improving performance and scalability."
    ]
  }
]
